99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_ftm/esp32_mquickjs_wifi_ftm.c
#include "esp32_mquickjs_wifi_ftm.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
#include "esp32_mquickjs_wifi_ftm_session.h"
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include <stdio.h>

typedef enum { FTM_OPEN, FTM_RECEIVE, FTM_END, FTM_CLOSE } ftm_operation_t;
typedef struct {
    wifi_ftm_initiator_cfg_t config;
    uint32_t timeout_ms, report_capacity;
} ftm_options_t;
struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_ftm_session_t *session;
    uint32_t timeout_ms;
    ftm_operation_t operation;
    esp_err_t error;
    int64_t receive_deadline_us;
    bool started, cancelled, receive_timed_out;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

static int ftm_hex(char c)
{
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}
static bool ftm_mac(JSContext *ctx, JSValue value, uint8_t output[6])
{
    if (!JS_IsString(ctx, value)) return false;
    size_t length = 0;
    JSCStringBuf buffer;
    const char *text = JS_ToCStringLen(ctx, &length, value, &buffer);
    if (text == NULL || length != 17) return false;
    for (size_t i = 0; i < 6; ++i) {
        int high = ftm_hex(text[i * 3]), low = ftm_hex(text[i * 3 + 1]);
        if (high < 0 || low < 0 || (i != 5 && text[i * 3 + 2] != ':')) return false;
        output[i] = (uint8_t)(high * 16 + low);
    }
    return true;
}
static JSValue ftm_address(JSContext *ctx, const uint8_t bytes[6])
{
    char address[18];
    snprintf(address, sizeof(address), "%02x:%02x:%02x:%02x:%02x:%02x",
        bytes[0], bytes[1], bytes[2], bytes[3], bytes[4], bytes[5]);
    return JS_NewString(ctx, address);
}
static bool ftm_options(JSContext *ctx, JSGCRef *root, ftm_options_t *output)
{
    static const char *const keys[] = {"peerAddress", "channel", "frameCount", "burstPeriodMs", "maxReportEntries", "timeoutMs"};
    ftm_options_t options = {.timeout_ms = 1000, .report_capacity = ESP32_MQUICKJS_WIFI_FTM_MAX_REPORT_ENTRIES};
    uint32_t number;
    JSGCRef ref;
    JSValue *field = JS_PushGCRef(ctx, &ref);
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, root->val, "wifi.ftm.start", keys, 6)) goto done;
#define FIELD(name) do { *field = JS_GetPropertyStr(ctx, root->val, name); if (JS_IsException(*field)) goto done; } while (0)
    FIELD("peerAddress");
    if (!ftm_mac(ctx, *field, options.config.resp_mac)) goto invalid;
    FIELD("channel");
    if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 177, &number)) goto invalid;
    if (number > 14) {
#if CONFIG_SOC_WIFI_SUPPORT_5G
        if (!esp32_mquickjs_wifi_radio_5ghz_channel_bit(number)) goto invalid;
#else
        goto invalid;
#endif
    }
    options.config.channel = (uint8_t)number;
    FIELD("frameCount");
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 0, 64, &number)) goto invalid;
        options.config.frm_count = (uint8_t)number;
    }
    FIELD("burstPeriodMs");
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 0, 10000, &number) || number % 100 != 0) goto invalid;
        options.config.burst_period = (uint16_t)(number / 100);
    }
    FIELD("maxReportEntries");
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 0,
        ESP32_MQUICKJS_WIFI_FTM_MAX_REPORT_ENTRIES, &options.report_capacity)) goto invalid;
    FIELD("timeoutMs");
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 60000, &options.timeout_ms)) goto invalid;
    if (!esp32_mquickjs_wifi_ftm_config_valid(&options.config)) goto invalid;
    *output = options; ok = true; goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid FTM options");
done:
    JS_PopGCRef(ctx, &ref); return ok;
#undef FIELD
}

static esp32_mquickjs_wifi_ftm_session_t *ftm_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_FTM_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiFtmSession"); return NULL;
    }
    esp32_mquickjs_wifi_ftm_session_t *session = JS_GetOpaque(ctx, value);
    if (session == NULL) JS_ThrowReferenceError(ctx, "invalid WiFiFtmSession");
    return session;
}
void js_wifi_ftm_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    esp32_mquickjs_wifi_ftm_close(opaque);
    esp32_mquickjs_wifi_ftm_release(opaque);
}
JSValue js_wifi_ftm_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.ftm.start()");
}
static const char *ftm_status_name(wifi_ftm_status_t status)
{
    static const char *const names[] = {"success", "unsupported", "configuration-rejected", "no-response", "failed", "no-valid-measurement", "terminated"};
    return (unsigned)status <= FTM_STATUS_USER_TERM ? names[(unsigned)status] : "unknown";
}
static const char *ftm_operation_name(ftm_operation_t operation)
{
    return operation == FTM_OPEN ? "wifi.ftm.start" : operation == FTM_RECEIVE ? "WiFiFtmSession.receive" :
        operation == FTM_END ? "WiFiFtmSession.end" : "WiFiFtmSession.close";
}
static JSValue ftm_error(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, bool timeout)
{
    esp32_mquickjs_wifi_ftm_status_t status = {0};
    if (state->session != NULL) (void)esp32_mquickjs_wifi_ftm_status(state->session, &status);
    bool closed = state->operation == FTM_RECEIVE && status.close_requested;
    esp_err_t error = timeout ? ESP_ERR_TIMEOUT : state->error ? state->error : status.error ? status.error : ESP_ERR_INVALID_STATE;
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details)) goto fail;
    SET(details, "espCode", JS_NewInt32(ctx, error));
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(error)));
    SET(details, "stage", JS_NewString(ctx, timeout ? "deadline" : closed ? "closed" : status.stage ? status.stage : "ftm-state"));
    SET(details, "sequence", status.native.token.identity ? JS_NewUint32(ctx, status.native.token.identity) : JS_NULL);
    SET(details, "radioGeneration", status.native.token.identity ? JS_NewUint32(ctx, status.native.token.generation) : JS_NULL);
    SET(details, "endRequested", JS_NewBool(status.end_requested));
    SET(details, "closeRequested", JS_NewBool(status.close_requested));
    SET(details, "cleanupPending", JS_NewBool(status.started && !status.retired));
    SET(details, "cleanupError", status.cleanup_error ? JS_NewInt32(ctx, status.cleanup_error) : JS_NULL);
    SET(details, "cleanupStage", status.cleanup_stage ? JS_NewString(ctx, status.cleanup_stage) : JS_NULL);
    (void)esp32_mquickjs_throw_native_error(ctx, timeout ? "WIFI_FTM_TIMEOUT" : closed ? "WIFI_FTM_CLOSED" : "WIFI_FTM_FAILED",
        ftm_operation_name(state->operation), "FTM operation did not complete; inspect session or wifi.ftm.status()", *details);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static JSValue ftm_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_ftm_status_t *status)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    bool fault = status->error || status->native.ambiguous ||
        (status->cleanup_error != ESP_OK && status->cleanup_error != ESP_ERR_TIMEOUT);
    SET(result, "state", JS_NewString(ctx, status->close_requested ? status->retired ? "closed" : "closing" :
        fault ? "faulted" : status->retired ? "completed" : status->native.terminal ? "draining" :
        status->end_requested ? "ending" : status->submitted ? "active" : "opening"));
    SET(result, "peerAddress", ftm_address(ctx, status->config.resp_mac));
    SET(result, "channel", JS_NewUint32(ctx, status->config.channel));
    SET(result, "frameCount", JS_NewUint32(ctx, status->config.frm_count));
    SET(result, "burstPeriodMs", JS_NewUint32(ctx, status->config.burst_period * 100U));
    SET(result, "driverAccepted", JS_NewBool(status->native.submitted && status->native.submit_error == ESP_OK));
    SET(result, "endRequested", JS_NewBool(status->end_requested));
    SET(result, "closeRequested", JS_NewBool(status->close_requested));
    SET(result, "cleanupPending", JS_NewBool(status->started && !status->retired));
    SET(result, "sequence", status->native.token.identity ? JS_NewUint32(ctx, status->native.token.identity) : JS_NULL);
    SET(result, "radioGeneration", status->native.token.identity ? JS_NewUint32(ctx, status->native.token.generation) : JS_NULL);
    SET(result, "terminalStatus", status->native.terminal ? JS_NewString(ctx, ftm_status_name(status->native.report.status)) : JS_NULL);
    SET(result, "terminalStatusId", status->native.terminal ? JS_NewInt32(ctx, status->native.report.status) : JS_NULL);
    SET(result, "ambiguous", JS_NewBool(status->native.ambiguous));
    SET(result, "physicalTermination", JS_NewBool(status->native.physical_termination));
    SET(result, "reportReady", JS_NewBool(status->report_ready));
    SET(result, "reportConsumed", JS_NewBool(status->native.report_consumed));
    SET(result, "reportDiscarded", JS_NewBool(status->native.report_discarded));
    SET(result, "reportCapacity", JS_NewUint32(ctx, status->report_capacity));
    SET(result, "retainedEntries", JS_NewUint32(ctx, status->retained_entries));
    SET(result, "reportEntries", status->native.terminal ? JS_NewUint32(ctx, status->native.report.ftm_report_num_entries) : JS_NULL);
    SET(result, "copiedEntries", JS_NewUint32(ctx, status->native.copied_entries));
    SET(result, "sdkFenced", JS_NewBool(status->native.sdk_fenced));
    SET(result, "eventFenced", JS_NewBool(status->native.event_fenced));
    SET(result, "error", status->error ? JS_NewInt32(ctx, status->error) : JS_NULL);
    SET(result, "stage", status->stage ? JS_NewString(ctx, status->stage) : JS_NULL);
    SET(result, "cleanupError", status->cleanup_error ? JS_NewInt32(ctx, status->cleanup_error) : JS_NULL);
    SET(result, "cleanupStage", status->cleanup_stage ? JS_NewString(ctx, status->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue ftm_timestamp(JSContext *ctx, uint64_t value)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "low", JS_NewUint32(ctx, (uint32_t)value));
    SET(result, "high", JS_NewUint32(ctx, (uint32_t)(value >> 32)));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue ftm_report_to_js(JSContext *ctx, esp32_mquickjs_wifi_ftm_session_t *session,
    const esp32_mquickjs_wifi_ftm_status_t *status)
{
    JSGCRef result_ref, entries_ref, item_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref), *entries = JS_PushGCRef(ctx, &entries_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *result = JS_NewObject(ctx);
    *entries = JS_NewArray(ctx, 0);
    if (JS_IsException(*result) || JS_IsException(*entries)) goto fail;
    bool measured = status->native.report.status == FTM_STATUS_SUCCESS && status->native.report.ftm_report_num_entries != 0U;
    SET(result, "sequence", JS_NewUint32(ctx, status->native.token.identity));
    SET(result, "radioGeneration", JS_NewUint32(ctx, status->native.token.generation));
    SET(result, "peerAddress", ftm_address(ctx, status->native.report.peer_mac));
    SET(result, "status", JS_NewString(ctx, ftm_status_name(status->native.report.status)));
    SET(result, "statusId", JS_NewInt32(ctx, status->native.report.status));
    SET(result, "rttRawNs", measured ? JS_NewUint32(ctx, status->native.report.rtt_raw) : JS_NULL);
    SET(result, "rttEstimatedNs", measured ? JS_NewUint32(ctx, status->native.report.rtt_est) : JS_NULL);
    SET(result, "distanceCm", measured ? JS_NewUint32(ctx, status->native.report.dist_est) : JS_NULL);
    SET(result, "reportEntries", JS_NewUint32(ctx, status->native.report.ftm_report_num_entries));
    SET(result, "copiedEntries", JS_NewUint32(ctx, status->native.copied_entries));
    SET(result, "truncated", JS_NewBool(status->native.copied_entries < status->native.report.ftm_report_num_entries));
    for (unsigned i = 0; i < status->native.copied_entries; ++i) {
        wifi_ftm_report_entry_t entry;
        if (!esp32_mquickjs_wifi_ftm_report_entry(session, i, &entry)) {
            JS_ThrowReferenceError(ctx, "FTM report was closed during conversion"); goto fail;
        }
        *item = JS_NewObject(ctx);
        if (JS_IsException(*item)) goto fail;
        SET(item, "dialogToken", JS_NewUint32(ctx, entry.dlog_token));
        SET(item, "rssi", JS_NewInt32(ctx, entry.rssi));
        SET(item, "rttPs", JS_NewUint32(ctx, entry.rtt));
        SET(item, "t1Ps", ftm_timestamp(ctx, entry.t1));
        SET(item, "t2Ps", ftm_timestamp(ctx, entry.t2));
        SET(item, "t3Ps", ftm_timestamp(ctx, entry.t3));
        SET(item, "t4Ps", ftm_timestamp(ctx, entry.t4));
        SET(item, "ppm", JS_NewInt32(ctx, entry.ppm));
        if (JS_IsException(JS_SetPropertyUint32(ctx, *entries, i, *item))) goto fail;
    }
    SET(result, "entries", *entries);
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &entries_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &entries_ref); JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}
JSValue js_wifi_ftm_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "WiFiFtmSession.status expects no arguments");
    esp32_mquickjs_wifi_ftm_session_t *session = ftm_receiver(ctx, *self);
    if (session == NULL) return JS_EXCEPTION;
    esp32_mquickjs_wifi_ftm_status_t status;
    (void)esp32_mquickjs_wifi_ftm_status(session, &status);
    return ftm_status_to_js(ctx, &status);
}
JSValue js_wifi_ftm_global_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.ftm.status expects no arguments");
    esp32_mquickjs_wifi_ftm_counts_t counts;
    esp32_mquickjs_wifi_ftm_counts(&counts);
    esp32_mquickjs_wifi_ftm_status_t status;
    bool active = esp32_mquickjs_wifi_ftm_current_status(&status);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "active", JS_NewBool(counts.active));
    SET(result, "handles", JS_NewUint32(ctx, counts.handles));
    SET(result, "reservedEntries", JS_NewUint32(ctx, counts.reserved_entries));
    SET(result, "workerBusy", JS_NewBool(counts.worker_busy));
    SET(result, "cleanupPending", JS_NewBool(counts.cleanup_pending));
    SET(result, "session", active ? ftm_status_to_js(ctx, &status) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

