99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_ftm/esp32_mquickjs_wifi_ftm.c
static void ftm_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    bool service = state->started && state->operation != FTM_RECEIVE;
    if (state->session != NULL) {
        if (state->operation == FTM_OPEN) esp32_mquickjs_wifi_ftm_close(state->session);
        esp32_mquickjs_wifi_ftm_release(state->session);
    }
    esp32_mquickjs_memory_payload_free(state);
    if (service) (void)esp32_mquickjs_wifi_ftm_service();
}
static bool ftm_open_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output)
{
    (void)self; *output = NULL;
    if (argc != 1) { JS_ThrowTypeError(ctx, "wifi.ftm.start expects options"); return false; }
    ftm_options_t options;
    if (!ftm_options(ctx, &argv[0], &options)) return false;
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) { JS_ThrowOutOfMemory(ctx); return false; }
    state->operation = FTM_OPEN; state->timeout_ms = options.timeout_ms;
    state->error = esp32_mquickjs_wifi_ftm_create(&options.config, options.report_capacity, &state->session);
    if (state->error != ESP_OK) { (void)ftm_error(ctx, state, false); ftm_destroy(state); return false; }
    *output = state; return true;
}
static bool ftm_method_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output, ftm_operation_t operation)
{
    *output = NULL;
    if (argc > 1) { JS_ThrowTypeError(ctx, "%s expects optional timeout options", ftm_operation_name(operation)); return false; }
    esp32_mquickjs_wifi_ftm_session_t *session = ftm_receiver(ctx, self->val);
    if (session == NULL) return false;
    /* Retain before options getters can close the receiver or trigger GC. */
    if (!esp32_mquickjs_wifi_ftm_retain(session)) { JS_ThrowInternalError(ctx, "FTM reference exhausted"); return false; }
    uint32_t timeout = 1000;
    bool valid = true;
    if (argc > 0 && !JS_IsUndefined(argv[0].val)) {
        static const char *const keys[] = {"timeoutMs"};
        valid = esp32_mquickjs_validate_plain_options(ctx, argv[0].val, ftm_operation_name(operation), keys, 1);
        if (valid) {
            JSGCRef ref;
            JSValue *value = JS_PushGCRef(ctx, &ref);
            *value = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
            valid = !JS_IsException(*value) && (JS_IsUndefined(*value) || esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, 60000, &timeout));
            JS_PopGCRef(ctx, &ref);
        }
    }
    if (!valid) {
        esp32_mquickjs_wifi_ftm_release(session);
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid FTM timeout options");
        return false;
    }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) { esp32_mquickjs_wifi_ftm_release(session); JS_ThrowOutOfMemory(ctx); return false; }
    state->session = session; state->operation = operation; state->timeout_ms = timeout;
    *output = state; return true;
}
static bool ftm_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **output)
{ return ftm_method_capture(ctx, self, argc, argv, output, FTM_RECEIVE); }
static bool ftm_end_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **output)
{ return ftm_method_capture(ctx, self, argc, argv, output, FTM_END); }
static bool ftm_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **output)
{ return ftm_method_capture(ctx, self, argc, argv, output, FTM_CLOSE); }
static bool ftm_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx; (void)runtime; (void)token;
    state->started = true;
    if (state->operation == FTM_RECEIVE) state->receive_deadline_us = esp_timer_get_time() + (int64_t)state->timeout_ms * 1000;
    if (state->operation == FTM_OPEN) state->error = esp32_mquickjs_wifi_ftm_start(state->session);
    if (state->operation == FTM_END) esp32_mquickjs_wifi_ftm_end(state->session);
    if (state->operation == FTM_CLOSE) esp32_mquickjs_wifi_ftm_close(state->session);
    (void)esp32_mquickjs_wifi_ftm_service();
    return true;
}
static esp32_mquickjs_future_poll_t ftm_poll(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->cancelled || state->error != ESP_OK) return ESP32_MQUICKJS_FUTURE_READY;
    (void)esp32_mquickjs_wifi_ftm_service();
    esp32_mquickjs_wifi_ftm_status_t status;
    (void)esp32_mquickjs_wifi_ftm_status(state->session, &status);
    bool ready = state->operation == FTM_OPEN ? status.submitted || status.retired :
        state->operation == FTM_RECEIVE ? status.retired || status.close_requested || status.error != ESP_OK : status.retired;
    if (!ready && state->operation == FTM_RECEIVE && esp_timer_get_time() >= state->receive_deadline_us) {
        state->receive_timed_out = true;
        ready = true;
    }
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}
static JSValue ftm_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->operation == FTM_RECEIVE && state->receive_timed_out) return JS_NULL;
    esp32_mquickjs_wifi_ftm_status_t status;
    (void)esp32_mquickjs_wifi_ftm_status(state->session, &status);
    if (state->error != ESP_OK || (state->operation != FTM_CLOSE && status.error != ESP_OK)) return ftm_error(ctx, state, false);
    if (state->operation == FTM_OPEN) {
        JSValue result = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_FTM_SESSION);
        if (JS_IsException(result)) return result;
        JS_SetOpaque(ctx, result, state->session);
        state->session = NULL;
        return result;
    }
    if (state->operation != FTM_RECEIVE) return JS_UNDEFINED;
    if (status.close_requested || !status.report_ready) return ftm_error(ctx, state, false);
    return ftm_report_to_js(ctx, state->session, &status);
}
static esp32_mquickjs_cancel_result_t ftm_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    /* receive changes no native intent. Started end preserves its report;
     * started close keeps cleanup; an abandoned open leaves no orphan handle. */
    if (state->started && (state->operation == FTM_OPEN || state->operation == FTM_CLOSE))
        esp32_mquickjs_wifi_ftm_close(state->session);
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}
/* Core on_timeout is a rejection hook, not a nullable completion. receive uses
 * its own scheduled-wait deadline and finishes normally with null. */
static uint32_t ftm_timeout(const esp32_mquickjs_future_driver_state_t *state)
{
    return state->operation == FTM_RECEIVE ? 0U : state->timeout_ms;
}
static JSValue ftm_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    (void)ftm_cancel(state);
    return ftm_error(ctx, state, true);
}
#define FTM_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = ftm_start, .poll = ftm_poll, .finish = ftm_finish, \
    .cancel = ftm_cancel, .destroy = ftm_destroy, .timeout_ms = ftm_timeout, .on_timeout = ftm_on_timeout }
static const esp32_mquickjs_future_driver_t s_ftm_open_driver = FTM_DRIVER(ftm_open_capture);
static const esp32_mquickjs_future_driver_t s_ftm_receive_driver = FTM_DRIVER(ftm_receive_capture);
static const esp32_mquickjs_future_driver_t s_ftm_end_driver = FTM_DRIVER(ftm_end_capture);
static const esp32_mquickjs_future_driver_t s_ftm_close_driver = FTM_DRIVER(ftm_close_capture);
static JSValue ftm_call(JSContext *ctx, JSValue *receiver, int argc, JSValue *argv, const char *name)
{
    JSGCRef self_ref, method_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *self = *receiver; *method = JS_GetPropertyStr(ctx, *self, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *self, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &self_ref); return result;
}
JSValue js_wifi_ftm_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return ftm_call(ctx, self, argc, argv, "receive"); }
JSValue js_wifi_ftm_end(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return ftm_call(ctx, self, argc, argv, "end"); }
JSValue js_wifi_ftm_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return ftm_call(ctx, self, argc, argv, "close"); }
JSValue js_wifi_ftm_start(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self;
    JSGCRef global_ref, wifi_ref, module_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "ftm");
    JSValue result = JS_IsException(*module) ? JS_EXCEPTION : ftm_call(ctx, module, argc, argv, "start");
    JS_PopGCRef(ctx, &module_ref); JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref); return result;
}
bool esp32_mquickjs_init_wifi_ftm_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, method_ref, child_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref), *child = JS_PushGCRef(ctx, &child_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "wifi");
    if (JS_IsException(*object)) goto done;
    *child = JS_GetPropertyStr(ctx, *object, "ftm");
    if (JS_IsException(*child)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "start");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_ftm_open_driver)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiFtmSession");
    if (JS_IsException(*object)) goto done;
    *child = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*child)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "receive");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_ftm_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "end");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_ftm_end_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_ftm_close_driver)) goto done;
    ok = esp32_mquickjs_init_wifi_ftm_recovery_runtime(ctx, runtime);
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register FTM runtime");
    JS_PopGCRef(ctx, &child_ref); JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
